In [1]:
import pandas as pd

In [3]:
dict1 = {
    'Name':['Priyang','Aadhya','Krishna','Vedant','Parshv','Mittal','Archana'],
    'Marks':[98,89,99,87,90,83,99],
    'Gender':['male','female','female','male','male','female','female']
}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    male
1   Aadhya     89  female
2  Krishna     99  female
3   Vedant     87    male
4   Parshv     90    male
5   Mittal     83  female
6  Archana     99  female

### 1.Display Top 10 Rows of The Dataset

In [15]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    male
1   Aadhya     89  female
2  Krishna     99  female

### 2. Check Last 10 Rows of The Dataset

In [14]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    male
5   Mittal     83  female
6  Archana     99  female

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [20]:
print(df1.shape)
print("number of rows", df1.shape[0])
print("number of columns", df1.shape[1])

number of rows 7
number of columns 3

### 4. Getting Information About Our Dataset Like Total Number Rows, 
### Total Number of Columns, Datatypes of Each Column And Memory Requirement

### 5.Check Null Values In The Dataset

### 6. Drop ID, Notes, Agency and Status Columns

### 7. Get Overall Statistics About The Dataframe

### 8. Find Occurrence of The Employee Names  (Top 5)

### 9. Find The Number of Unique Job Titles

### 10. Total Number of Job Titles Contain Captain

### 11. Display All the Employee Names From Fire Department

### 12. Find Minimum, Maximum and Average BasePay

### 13. Replace 'Not Provided' in EmployeeName' Column to NaN

### 14. Drop The Rows Having 5 Missing Values

### 15. Find Job Title of ALBERT PARDINI

### 16. How Much ALBERT PARDINI Make (Include Benefits) ?

### 17. Display Name of The Person Having The Highest BasePay

### 18. Find Average BasePay of All Employee Per Year

### 19. Find Average BasePay of All Employee Per JobTitle

### 20. Find Average BasePay of Employee Having Job Title ACCOUNTANT

### 21. Find Top 5 Most Common Jobs